In [16]:
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
data_path="nutural_disaster_data.csv"
data=pd.read_csv(data_path)
data=data.loc[:,["Year","Disaster Type","Country"]]
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16126 entries, 0 to 16125
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Year           16126 non-null  int64
 1   Disaster Type  16126 non-null  object
 2   Country        16126 non-null  object
dtypes: int64(1), object(2)
memory usage: 378.1+ KB

In [8]:
data.head(5)

   Year      Disaster Type     Country
0  1900            Drought  Cabo Verde
1  1900            Drought       India
2  1902         Earthquake   Guatemala
3  1902  Volcanic activity   Guatemala
4  1902  Volcanic activity   Guatemala

In [11]:
data_country=data.groupby(by=['Country']).count()

In [15]:
data_country.sort_values(by=['Year'],ascending=False)

                                              Year  Disaster Type
Country
United States of America (the)                1087           1087
China                                          980            980
India                                          752            752
Philippines (the)                              668            668
Indonesia                                      572            572
...                                            ...            ...
Equatorial Guinea                                1              1
Sint Maarten (Dutch part)                        1              1
Isle of Man                                      1              1
Saint Helena, Ascension and Tristan da Cunha     1              1
Qatar                                            1              1

[228 rows x 2 columns]

In [18]:
data.groupby("Country").size().sort_values(ascending=False)

Country
United States of America (the)                  1087
China                                            980
India                                            752
Philippines (the)                                668
Indonesia                                        572
                                                ...
Equatorial Guinea                                  1
Sint Maarten (Dutch part)                          1
Isle of Man                                        1
Saint Helena, Ascension and Tristan da Cunha       1
Qatar                                              1
Length: 228, dtype: int64